УчетВУправляющихДляГит1/src/Documents/КВП_ВводФактическихЗатратНаОбъект/КВП_ВводФактическихЗатратНаОбъект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_ВводФактическихЗатратНаОбъект</name>
  <basedOn>Document.КВП_РаспределениеМатериалов</basedOn>
  <basedOn>Document.КВП_РаспределениеУслугСтороннихОрганизаций</basedOn>
  <registerRecords>AccumulationRegister.УПЖКХ_НачисленияПоДобровольномуСтрахованию</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_Начисления</registerRecords>
  <registerRecords>AccumulationRegister.КВП_НачислениеДляОтраженияВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.КВП_ВзаиморасчетыПоЛицевымСчетам</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_ДанныеДляОтраженияНачисленийВРеглУчете</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.КВП_ВидыОперацийВводаФактическихЗатратНаОбъект</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределения</name>
    <type>
      <types>EnumRef.УПЖКХ_ВариантыРаспределенияФактическихЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыУчета</name>
    <attributes>
      <name>ОбъектУчета</name>
      <type>
        <types>CatalogRef.КВП_Здания</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРаспределения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРаспределения</name>
      <type>
        <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
        <types>String</types>
        <types>CatalogRef.КВП_Услуги</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРаспределения</name>
    <attributes>
      <name>ОбъектУчета</name>
      <type>
        <types>CatalogRef.КВП_Здания</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛицевойСчет</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРаспределения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРаспределения</name>
      <type>
        <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
        <types>String</types>
        <types>CatalogRef.КВП_Услуги</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>DefinedType.УПЖКХ_ТарифНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПарковочноеМесто</name>
      <type>
        <types>CatalogRef.УПЖКХ_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/КВП_ВводФактическихЗатратНаОбъект/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	Реквизиты.Комментарий,
	|	Реквизиты.Ответственный,
	|	Реквизиты.СуммаДокумента
	|ИЗ
	|	Документ.КВП_ВводФактическихЗатратНаОбъект КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Организация,
								|Комментарий,Ответственный,СуммаДокумента");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Ссылка,
	|	ТаблицаРаспределения.НомерСтроки,
	|	ТаблицаРаспределения.ОбъектУчета,
	|	ТаблицаРаспределения.ЛицевойСчет,
	|	ТаблицаРаспределения.Услуга,
	|	ТаблицаРаспределения.Количество,
	|	ТаблицаРаспределения.Тариф,
	|	ТаблицаРаспределения.Сумма
	|ИЗ
	|	Документ.КВП_ВводФактическихЗатратНаОбъект.ТаблицаРаспределения КАК ТаблицаРаспределения
	|ГДЕ
	|	ТаблицаРаспределения.Ссылка = &Ссылка";
	
	ТаблицаЛицевыхСчетов = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПроведения.Вставить("ТаблицаЛицевыхСчетов", ТаблицаЛицевыхСчетов);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти 

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
